src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияРасходов</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорииДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/КатегорииРасходов/КатегорииРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииРасходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Еда</name>
      <description>Еда</description>
    </items>
    <items>
      <name>Дом</name>
      <description>Дом</description>
    </items>
    <items>
      <name>КоммунальныеУслуги</name>
      <description>Коммунальные услуги</description>
    </items>
    <items>
      <name>Авто</name>
      <description>Авто</description>
    </items>
    <items>
      <name>Транспорт</name>
      <description>Транспорт</description>
    </items>
    <items>
      <name>Банк</name>
      <description>Банк</description>
    </items>
    <items>
      <name>ГаджетыКомпьютеры</name>
      <description>Гаджеты/компьютеры</description>
    </items>
    <items>
      <name>Развлечения</name>
      <description>Развлечения</description>
    </items>
    <items>
      <name>Одежда</name>
      <description>Одежда</description>
    </items>
    <items>
      <name>Здоровье</name>
      <description>Здоровье</description>
    </items>
    <items>
      <name>КрасотаИЗдоровье</name>
      <description>Красота и здоровье</description>
    </items>
    <items>
      <name>Личное</name>
      <description>Личное</description>
    </items>
    <items>
      <name>Отдых</name>
      <description>Отдых</description>
    </items>
    <items>
      <name>Семья</name>
      <description>Семья</description>
    </items>
    <items>
      <name>Спорт</name>
      <description>Спорт</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
    <items>
      <name>НалогиПошлины</name>
      <description>Налоги/пошлины</description>
    </items>
    <items>
      <name>СистемныеКатегории</name>
      <description>Системные категории</description>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИконки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КатегорииДоходов/КатегорииДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииДоходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Зарплата</name>
      <description>Зарплата</description>
    </items>
    <items>
      <name>Бонус</name>
      <description>Бонус</description>
    </items>
    <items>
      <name>ПроцентыКешбэк</name>
      <description>Проценты / кешбэк</description>
    </items>
    <items>
      <name>ВозвратСредств</name>
      <description>Возврат средств</description>
    </items>
    <items>
      <name>ПрочийДоход</name>
      <description>Прочие доходы</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИконки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОбщийМодульСервер_Категории/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры HTML-форм справочников категорий доходов и расходов (Wallet).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Собирает HTML списка категорий с группами (навигация по родителю).
//
Функция HTMLСпискаКатегорий(ЭтоРасход, СтрокаПоиска = "", ТекущийРодитель = Неопределено) Экспорт
	
	Акцент = АкцентКатегорий(ЭтоРасход);
	ЗаголовокСписка = ЗаголовокСпискаКатегорий(ЭтоРасход, ТекущийРодитель);
	Подсказка = ?(ЭтоРасход,
		"Категории используются в документах расхода и отчетах",
		"Категории используются в документах дохода и отчетах");
	ПлейсхолдерПоиска = "Поиск категории";
	ЕстьПоиск = Не ПустаяСтрока(СокрЛП(СтрокаПоиска));
	
	Таблица = ТаблицаКатегорийДляСписка(ЭтоРасход, СтрокаПоиска, ТекущийРодитель);
	Статистика = СтатистикаОперацийКатегорий(ЭтоРасход, Ложь);
	
	Строки = Новый Массив;
	ДобавитьШапкуHTML(Строки, СтилиСпискаИВыбора(Акцент));
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ЗаголовокСписка) + "</div>");
	Строки.Добавить("<a class=""icon-btn"" href=""app:add"">" + SVGПлюс(Акцент) + "</a></div>");
	Строки.Добавить("<a class=""search"" href=""app:search""><span class=""search-ico"">" + SVGПоиск()
		+ "</span><span class=""search-text"">"
		+ ЭкранироватьHTML(?(ЕстьПоиск, СтрокаПоиска, ПлейсхолдерПоиска))
		+ "</span></a>");
	Строки.Добавить("<div class=""info"">" + ЭкранироватьHTML(Подсказка) + "</div>");
	Строки.Добавить("<div class=""list"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Категории не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаКатегории Из Таблица Цикл
			
			Если СтрокаКатегории.ЭтоГруппа Тогда
				
				Ссылка = "app:folder:" + Строка(СтрокаКатегории.Ссылка.УникальныйИдентификатор());
				Строки.Добавить("<a class=""item group"" href=""" + Ссылка + """>");
				Строки.Добавить("<span class=""ico"" style=""background:#EEF2FF;color:#4F46E5"">"
					+ SVGПапка() + "</span>");
				Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаКатегории.Наименование)
					+ "</span><span class=""sub"">Группа</span></span>");
				Строки.Добавить("<span class=""right""><span class=""chev"">›</span></span></a>");
				
			Иначе
				
				Количество = 0;
				СтрокаСтатистики = Статистика.Найти(СтрокаКатегории.Ссылка, "Категория");
				
				Если СтрокаСтатистики <> Неопределено Тогда
					
					Количество = СтрокаСтатистики.Количество;
					
				КонецЕсли;
				
				ПодписьКоличества = ПредставлениеКоличестваОпераций(Количество);
				КодИконки = КодИконкиКатегории(СтрокаКатегории.КодИконки, СтрокаКатегории.Наименование, ЭтоРасход);
				Описание = ?(ЗначениеЗаполнено(СтрокаКатегории.Описание), СтрокаКатегории.Описание, "Без описания");
				Ссылка = "app:open:" + Строка(СтрокаКатегории.Ссылка.УникальныйИдентификатор());
				
				Строки.Добавить("<a class=""item"" href=""" + Ссылка + """>");
				Строки.Добавить("<span class=""ico"" style=""background:" + Акцент.ФонИконки + ";color:" + Акцент.Цвет
					+ """>" + SVGИконкаКатегории(КодИконки) + "</span>");
				Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаКатегории.Наименование)
					+ "</span><span class=""sub"">" + ЭкранироватьHTML(Описание) + "</span></span>");
				Строки.Добавить("<span class=""right""><span class=""meta"">" + ЭкранироватьHTML(ПодписьКоличества)
					+ "</span><span class=""chev"">›</span></span></a>");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// Собирает HTML формы выбора категории.
//
Функция HTMLВыбораКатегорий(ЭтоРасход, ТекущаяКатегория = Неопределено, СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентКатегорий(ЭтоРасход);
	ЗаголовокВыбора = ?(ЭтоРасход, "Выбор расхода", "Выбор дохода");
	Подсказка = ?(ЭтоРасход, "Выберите категорию для операции расхода", "Выберите категорию для операции дохода");
	ПлейсхолдерПоиска = "Найти категорию";
	
	Таблица = ТаблицаКатегорий(ЭтоРасход, СтрокаПоиска, Истина);
	
	Строки = Новый Массив;
	ДобавитьШапкуHTML(Строки, СтилиСпискаИВыбора(Акцент) + СтилиКнопкиВыбора(Акцент));
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ЗаголовокВыбора) + "</div>");
	Строки.Добавить("<a class=""icon-btn"" href=""app:add"">" + SVGПлюс(Акцент) + "</a></div>");
	Строки.Добавить("<a class=""search"" href=""app:search""><span class=""search-ico"">" + SVGПоиск()
		+ "</span><span class=""search-text"">"
		+ ЭкранироватьHTML(?(ПустаяСтрока(СтрокаПоиска), ПлейсхолдерПоиска, СтрокаПоиска))
		+ "</span></a>");
	Строки.Добавить("<div class=""hint"">" + ЭкранироватьHTML(Подсказка) + "</div>");
	Строки.Добавить("<div class=""list choice"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Категории не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаКатегории Из Таблица Цикл
			
			Выбран = ЗначениеЗаполнено(ТекущаяКатегория) И СтрокаКатегории.Ссылка = ТекущаяКатегория;
			Класс = ?(Выбран, "item selected", "item");
			КодИконки = КодИконкиКатегории(СтрокаКатегории.КодИконки, СтрокаКатегории.Наименование, ЭтоРасход);
			Описание = ?(ЗначениеЗаполнено(СтрокаКатегории.Описание), СтрокаКатегории.Описание, "Без описания");
			Ссылка = "app:pick:" + Строка(СтрокаКатегории.Ссылка.УникальныйИдентификатор());
			
			Строки.Добавить("<a class=""" + Класс + """ href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""ico"" style=""background:" + Акцент.ФонИконки + ";color:" + Акцент.Цвет
				+ """>" + SVGИконкаКатегории(КодИконки) + "</span>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаКатегории.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(Описание) + "</span></span>");
			
			Если Выбран Тогда
				
				Строки.Добавить("<span class=""check"">✓</span>");
				
			Иначе
				
				Строки.Добавить("<span class=""chev"">›</span>");
				
			КонецЕсли;
			
			Строки.Добавить("</a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div>");
	
	Если ЗначениеЗаполнено(ТекущаяКатегория) Тогда
		
		ПодписьКнопки = "Выбрать: " + Строка(ТекущаяКатегория);
		Строки.Добавить("<div class=""footer""><a class=""btn"" href=""app:confirm"">"
			+ ЭкранироватьHTML(ПодписьКнопки) + "</a></div>");
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// Собирает HTML карточки категории (элемент / набор иконок / выбор родителя).
//
Функция HTMLЭлементаКатегории(ЭтоРасход, ДанныеКатегории, РежимВыбораИконки = Ложь, РежимВыбораРодителя = Ложь) Экспорт
	
	Акцент = АкцентКатегорий(ЭтоРасход);
	ЗаголовокФормы = ?(ЭтоРасход, "Категория расхода", "Категория дохода");
	Инфо = ?(ЭтоРасход,
		"Категория будет доступна в документе «Новый расход» и отчетах по расходам",
		"Категория будет доступна в документе «Новый доход» и отчетах по доходам");
	
	Если РежимВыбораИконки Тогда
		
		Возврат HTMLНабораИконок(ЭтоРасход, ДанныеКатегории, Акцент, ЗаголовокФормы);
		
	КонецЕсли;
	
	Если РежимВыбораРодителя Тогда
		
		Возврат HTMLВыбораРодителя(ЭтоРасход, ДанныеКатегории, Акцент, ЗаголовокФормы);
		
	КонецЕсли;
	
	КодИконки = КодИконкиКатегории(ДанныеКатегории.КодИконки, ДанныеКатегории.Наименование, ЭтоРасход);
	Наименование = ?(ЗначениеЗаполнено(ДанныеКатегории.Наименование), ДанныеКатегории.Наименование, "Без названия");
	Описание = ?(ЗначениеЗаполнено(ДанныеКатегории.Описание), ДанныеКатегории.Описание, "Добавить описание");
	РодительТекст = ?(ЗначениеЗаполнено(ДанныеКатегории.РодительНаименование), ДанныеКатегории.РодительНаименование, "Без группы");
	Показывать = ?(ДанныеКатегории.ПоказыватьВВыборе, "on", "off");
	МожноЗаписать = ЗначениеЗаполнено(ДанныеКатегории.Наименование);
	ПодписьКнопки = ?(МожноЗаписать, "Записать категорию", "Укажите наименование");
	КлассКнопки = ?(МожноЗаписать, "btn", "btn disabled");
	СсылкаКнопки = ?(МожноЗаписать, "app:save", "app:noop");
	
	Строки = Новый Массив;
	ДобавитьШапкуHTML(Строки, СтилиЭлемента(Акцент));
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ЗаголовокФормы) + "</div>");
	
	Если ДанныеКатегории.Предопределенный Тогда
		
		Строки.Добавить("<span class=""icon-btn ghost""></span>");
		
	Иначе
		
		Строки.Добавить("<a class=""icon-btn"" href=""app:delete"">" + SVGКорзина() + "</a>");
		
	КонецЕсли;
	
	Строки.Добавить("</div>");
	Строки.Добавить("<a class=""hero"" href=""app:icons"">");
	Строки.Добавить("<span class=""ico big"" style=""background:" + Акцент.ФонИконки + ";color:" + Акцент.Цвет
		+ """>" + SVGИконкаКатегории(КодИконки) + "</span>");
	Строки.Добавить("<span class=""hero-text"">Иконка и цвет</span><span class=""chev"">›</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:name""><span class=""label"">Наименование</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(Наименование) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:desc""><span class=""label"">Описание</span>"
		+ "<span class=""value muted"">" + ЭкранироватьHTML(Описание) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:parent""><span class=""label"">Группа</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(РодительТекст) + "</span></a>");
	Строки.Добавить("<a class=""card row"" href=""app:toggle-show""><span class=""label"">Показывать в выборе</span>"
		+ "<span class=""switch " + Показывать + """></span></a>");
	Строки.Добавить("<div class=""info"">" + ЭкранироватьHTML(Инфо) + "</div>");
	Строки.Добавить("<div class=""footer""><a class=""" + КлассКнопки + """ href=""" + СсылкаКнопки + """>"
		+ ЭкранироватьHTML(ПодписьКнопки) + "</a></div>");
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// Возвращает ссылку категории по UUID-строке.
//
Функция КатегорияПоИдентификатору(ЭтоРасход, ИдентификаторСтрокой) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокой) Тогда
		
		Возврат ?(ЭтоРасход, Справочники.КатегорииРасходов.ПустаяСсылка(), Справочники.КатегорииДоходов.ПустаяСсылка());
		
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(ИдентификаторСтрокой);
	
	Если ЭтоРасход Тогда
		
		Возврат Справочники.КатегорииРасходов.ПолучитьСсылку(Идентификатор);
		
	КонецЕсли;
	
	Возврат Справочники.КатегорииДоходов.ПолучитьСсылку(Идентификатор);
	
КонецФункции

// Возвращает данные категории для карточки операции: имя, описание, SVG, цвета.
//
Функция ДанныеОтображенияКатегории(ЭтоРасход, Категория) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Заполнена", Ложь);
	Результат.Вставить("Наименование", "Выберите категорию");
	Результат.Вставить("Описание", "Категория операции");
	Результат.Вставить("SVG", SVGИконкаКатегории(?(ЭтоРасход, "other", "wallet")));
	Результат.Вставить("ЦветИконки", ?(ЭтоРасход, "#DC2626", "#16A34A"));
	Результат.Вставить("ФонИконки", ?(ЭтоРасход, "#FEE2E2", "#DCFCE7"));
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Наименование = Строка(Категория);
	Описание = "";
	КодИконки = "";
	
	Если ЭтоРасход Тогда
		
		Значения = ОбщегоНазначенияЗначенияРеквизитовКатегорииРасхода(Категория);
		
	Иначе
		
		Значения = ОбщегоНазначенияЗначенияРеквизитовКатегорииДохода(Категория);
		
	КонецЕсли;
	
	Если Значения <> Неопределено Тогда
		
		Наименование = Значения.Наименование;
		Описание = Значения.Описание;
		КодИконки = Значения.КодИконки;
		
	КонецЕсли;
	
	Код = КодИконкиКатегории(КодИконки, Наименование, ЭтоРасход);
	Результат.Заполнена = Истина;
	Результат.Наименование = Наименование;
	Результат.Описание = ?(ЗначениеЗаполнено(Описание), Описание, "Без описания");
	Результат.SVG = SVGИконкаКатегории(Код);
	
	Возврат Результат;
	
КонецФункции

// Экранирует текст для HTML.
//
Функция ЭкранироватьHTML(Знач Текст) Экспорт
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбщегоНазначенияЗначенияРеквизитовКатегорииРасхода(Категория)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Категории.Наименование КАК Наименование,
	|	Категории.Описание КАК Описание,
	|	Категории.КодИконки КАК КодИконки
	|ИЗ
	|	Справочник.КатегорииРасходов КАК Категории
	|ГДЕ
	|	Категории.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Категория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("Наименование, Описание, КодИконки",
			Выборка.Наименование, Выборка.Описание, Выборка.КодИконки);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОбщегоНазначенияЗначенияРеквизитовКатегорииДохода(Категория)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Категории.Наименование КАК Наименование,
	|	Категории.Описание КАК Описание,
	|	Категории.КодИконки КАК КодИконки
	|ИЗ
	|	Справочник.КатегорииДоходов КАК Категории
	|ГДЕ
	|	Категории.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Категория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("Наименование, Описание, КодИконки",
			Выборка.Наименование, Выборка.Описание, Выборка.КодИконки);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция HTMLНабораИконок(ЭтоРасход, ДанныеКатегории, Акцент, ЗаголовокФормы)
	
	ТекущийКод = КодИконкиКатегории(ДанныеКатегории.КодИконки, ДанныеКатегории.Наименование, ЭтоРасход);
	Коды = НаборКодовИконок(ЭтоРасход);
	
	Строки = Новый Массив;
	ДобавитьШапкуHTML(Строки, СтилиЭлемента(Акцент) + СтилиСеткиИконок(Акцент));
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:icons-back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ЗаголовокФормы) + "</div>");
	Строки.Добавить("<span class=""icon-btn ghost""></span></div>");
	Строки.Добавить("<div class=""section-title"">Выберите иконку</div>");
	Строки.Добавить("<div class=""icons"">");
	
	Для Каждого Код Из Коды Цикл
		
		Выбран = Код = ТекущийКод;
		Класс = ?(Выбран, "icon-cell selected", "icon-cell");
		Строки.Добавить("<a class=""" + Класс + """ href=""app:icon:" + Код + """>"
			+ "<span class=""ico"" style=""background:" + Акцент.ФонИконки + ";color:" + Акцент.Цвет + """>"
			+ SVGИконкаКатегории(Код) + "</span></a>");
		
	КонецЦикла;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция HTMLВыбораРодителя(ЭтоРасход, ДанныеКатегории, Акцент, ЗаголовокФормы)
	
	ТаблицаГрупп = ТаблицаГруппКатегорий(ЭтоРасход, ДанныеКатегории.Ссылка);
	ТекущийРодитель = ДанныеКатегории.Родитель;
	
	Строки = Новый Массив;
	ДобавитьШапкуHTML(Строки, СтилиСпискаИВыбора(Акцент));
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:parent-back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ЗаголовокФормы) + "</div>");
	Строки.Добавить("<span class=""icon-btn ghost""></span></div>");
	Строки.Добавить("<div class=""section-title"">Выберите группу</div>");
	Строки.Добавить("<div class=""list"">");
	
	КлассПустой = ?(Не ЗначениеЗаполнено(ТекущийРодитель), "item selected", "item");
	Строки.Добавить("<a class=""" + КлассПустой + """ href=""app:set-parent-empty"">");
	Строки.Добавить("<span class=""ico"" style=""background:#F3F4F6;color:#6B7280"">" + SVGПапка() + "</span>");
	Строки.Добавить("<span class=""mid""><span class=""name"">Без группы</span>"
		+ "<span class=""sub"">Корень справочника</span></span>");
	
	Если Не ЗначениеЗаполнено(ТекущийРодитель) Тогда
		
		Строки.Добавить("<span class=""check"">✓</span>");
		
	КонецЕсли;
	
	Строки.Добавить("</a>");
	
	Для Каждого СтрокаГруппы Из ТаблицаГрупп Цикл
		
		Выбран = ЗначениеЗаполнено(ТекущийРодитель) И СтрокаГруппы.Ссылка = ТекущийРодитель;
		Класс = ?(Выбран, "item selected", "item");
		Ссылка = "app:set-parent:" + Строка(СтрокаГруппы.Ссылка.УникальныйИдентификатор());
		Строки.Добавить("<a class=""" + Класс + """ href=""" + Ссылка + """>");
		Строки.Добавить("<span class=""ico"" style=""background:#EEF2FF;color:#4F46E5"">" + SVGПапка() + "</span>");
		Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаГруппы.Наименование)
			+ "</span><span class=""sub"">Группа</span></span>");
		
		Если Выбран Тогда
			
			Строки.Добавить("<span class=""check"">✓</span>");
			
		КонецЕсли;
		
		Строки.Добавить("</a>");
		
	КонецЦикла;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция ЗаголовокСпискаКатегорий(ЭтоРасход, ТекущийРодитель)
	
	Если ЗначениеЗаполнено(ТекущийРодитель) Тогда
		
		Возврат Строка(ТекущийРодитель);
		
	КонецЕсли;
	
	Возврат ?(ЭтоРасход, "Расходы", "Доходы");
	
КонецФункции

Функция ТаблицаКатегорийДляСписка(ЭтоРасход, СтрокаПоиска, ТекущийРодитель)
	
	ИмяСправочника = ?(ЭтоРасход, "КатегорииРасходов", "КатегорииДоходов");
	ЕстьПоиск = Не ПустаяСтрока(СокрЛП(СтрокаПоиска));
	Запрос = Новый Запрос;
	
	Если ЕстьПоиск Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Категории.Ссылка КАК Ссылка,
		|	Категории.Наименование КАК Наименование,
		|	Категории.Описание КАК Описание,
		|	Категории.КодИконки КАК КодИконки,
		|	Категории.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник." + ИмяСправочника + " КАК Категории
		|ГДЕ
		|	НЕ Категории.ПометкаУдаления
		|	И (Категории.Наименование ПОДОБНО &ШаблонПоиска
		|		ИЛИ Категории.Описание ПОДОБНО &ШаблонПоиска)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа УБЫВ,
		|	Наименование";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Категории.Ссылка КАК Ссылка,
		|	Категории.Наименование КАК Наименование,
		|	Категории.Описание КАК Описание,
		|	Категории.КодИконки КАК КодИконки,
		|	Категории.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник." + ИмяСправочника + " КАК Категории
		|ГДЕ
		|	НЕ Категории.ПометкаУдаления
		|	И Категории.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа УБЫВ,
		|	Наименование";
		Запрос.УстановитьПараметр("Родитель",
			?(ЗначениеЗаполнено(ТекущийРодитель), ТекущийРодитель,
				?(ЭтоРасход, Справочники.КатегорииРасходов.ПустаяСсылка(), Справочники.КатегорииДоходов.ПустаяСсылка())));
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СокрЛП(СтрокаПоиска) + "%");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаГруппКатегорий(ЭтоРасход, ИсключитьСсылку = Неопределено)
	
	ИмяСправочника = ?(ЭтоРасход, "КатегорииРасходов", "КатегорииДоходов");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Категории.Ссылка КАК Ссылка,
	|	Категории.Наименование КАК Наименование
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Категории
	|ГДЕ
	|	НЕ Категории.ПометкаУдаления
	|	И Категории.ЭтоГруппа
	|	И Категории.Ссылка <> &ИсключитьСсылку
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("ИсключитьСсылку",
		?(ЗначениеЗаполнено(ИсключитьСсылку), ИсключитьСсылку,
			?(ЭтоРасход, Справочники.КатегорииРасходов.ПустаяСсылка(), Справочники.КатегорииДоходов.ПустаяСсылка())));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаКатегорий(ЭтоРасход, СтрокаПоиска, ТолькоДляВыбора)
	
	ИмяСправочника = ?(ЭтоРасход, "КатегорииРасходов", "КатегорииДоходов");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Категории.Ссылка КАК Ссылка,
	|	Категории.Наименование КАК Наименование,
	|	Категории.Описание КАК Описание,
	|	Категории.КодИконки КАК КодИконки
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Категории
	|ГДЕ
	|	НЕ Категории.ПометкаУдаления
	|	И НЕ Категории.ЭтоГруппа
	|	И (&СтрокаПоиска = """"
	|		ИЛИ Категории.Наименование ПОДОБНО &ШаблонПоиска
	|		ИЛИ Категории.Описание ПОДОБНО &ШаблонПоиска)
	|	И (НЕ &ТолькоДляВыбора
	|		ИЛИ Категории.ПоказыватьВВыборе
	|		ИЛИ (Категории.КодИконки = """" И Категории.Описание = """"))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(СтрокаПоиска));
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СокрЛП(СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("ТолькоДляВыбора", ТолькоДляВыбора);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтатистикаОперацийКатегорий(ЭтоРасход, ТолькоТекущийМесяц)
	
	Запрос = Новый Запрос;
	
	Если ЭтоРасход Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Обороты.КатегорияРасходов КАК Категория,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Обороты.Регистратор) КАК Количество,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Расходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.КатегорияРасходов";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Обороты.КатегорииДоходов КАК Категория,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Обороты.Регистратор) КАК Количество,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Доходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.КатегорииДоходов";
		
	КонецЕсли;
	
	Если ТолькоТекущийМесяц Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
		
	Иначе
		
		Запрос.УстановитьПараметр("НачалоПериода", Дата(1, 1, 1));
		Запрос.УстановитьПараметр("КонецПериода", Дата(3999, 12, 31));
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтатистикаКатегории(ЭтоРасход, Категория)
	
	Результат = Новый Структура("Количество, Сумма, ПериодПодпись", 0, 0, Формат(ТекущаяДата(), "ДФ='MMMM yyyy'"));
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ЭтоРасход Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Обороты.Регистратор) КАК Количество,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Расходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, КатегорияРасходов = &Категория) КАК Обороты";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Обороты.Регистратор) КАК Количество,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Доходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, КатегорииДоходов = &Категория) КАК Обороты";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Категория", Категория);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат.Количество = ?(Выборка.Количество = Null, 0, Выборка.Количество);
		Результат.Сумма = ?(Выборка.Сумма = Null, 0, Выборка.Сумма);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Данные для HTML карточки элемента.
//
Функция ДанныеКатегорииДляHTML(ЭтоРасход, СсылкаКатегории, Наименование, Описание, КодИконки, ПоказыватьВВыборе,
	Предопределенный, Родитель = Неопределено) Экспорт
	
	Статистика = СтатистикаКатегории(ЭтоРасход, СсылкаКатегории);
	РодительСсылка = Родитель;
	
	Если РодительСсылка = Неопределено Тогда
		
		РодительСсылка = ?(ЭтоРасход, Справочники.КатегорииРасходов.ПустаяСсылка(),
			Справочники.КатегорииДоходов.ПустаяСсылка());
		
	КонецЕсли;
	
	Возврат Новый Структура(
		"Ссылка, Наименование, Описание, КодИконки, ПоказыватьВВыборе, Предопределенный, Родитель, РодительНаименование, КоличествоОпераций, СуммаОпераций, ПериодПодпись",
		СсылкаКатегории, Наименование, Описание, КодИконки, ПоказыватьВВыборе, Предопределенный,
		РодительСсылка, Строка(РодительСсылка),
		Статистика.Количество, Статистика.Сумма, Статистика.ПериодПодпись);
	
КонецФункции

Функция АкцентКатегорий(ЭтоРасход)
	
	Если ЭтоРасход Тогда
		
		Возврат Новый Структура("Цвет, ФонИконки, Кнопка", "#DC2626", "#FEE2E2", "#DC2626");
		
	КонецЕсли;
	
	Возврат Новый Структура("Цвет, ФонИконки, Кнопка", "#16A34A", "#DCFCE7", "#16A34A");
	
КонецФункции

Функция КодИконкиКатегории(КодИконки, Наименование, ЭтоРасход)
	
	Если ЗначениеЗаполнено(КодИконки) Тогда
		
		Возврат КодИконки;
		
	КонецЕсли;
	
	Ключ = НРег(СокрЛП(Наименование));
	Карта = КартаИконокПоНаименованию(ЭтоРасход);
	Значение = Карта.Получить(Ключ);
	
	Если Значение <> Неопределено Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат ?(ЭтоРасход, "other", "wallet");
	
КонецФункции

Функция КартаИконокПоНаименованию(ЭтоРасход)
	
	Карта = Новый Соответствие;
	
	Если ЭтоРасход Тогда
		
		Карта.Вставить("продукты", "cart");
		Карта.Вставить("азс", "fuel");
		Карта.Вставить("топливо", "fuel");
		Карта.Вставить("аренда", "home");
		Карта.Вставить("коммунальные услуги", "bolt");
		Карта.Вставить("электр./вода/газ", "bolt");
		Карта.Вставить("транспорт", "bus");
		Карта.Вставить("общественный транспорт", "bus");
		Карта.Вставить("такси", "car");
		Карта.Вставить("развлечения", "ticket");
		Карта.Вставить("кино", "ticket");
		Карта.Вставить("кафе", "cup");
		Карта.Вставить("обед", "cup");
		Карта.Вставить("одежда", "shirt");
		Карта.Вставить("одежда верхняя", "shirt");
		Карта.Вставить("здоровье", "medkit");
		Карта.Вставить("лекарства", "cross");
		Карта.Вставить("мобильная связь", "phone");
		Карта.Вставить("интернет дом./моб.", "wifi");
		Карта.Вставить("книги", "book");
		Карта.Вставить("подарки", "gift");
		Карта.Вставить("прочие расходы", "other");
		
	Иначе
		
		Карта.Вставить("зарплата", "wallet");
		Карта.Вставить("бонус", "gift");
		Карта.Вставить("проценты / кешбэк", "percent");
		Карта.Вставить("возврат средств", "refund");
		Карта.Вставить("прочие доходы", "other");
		Карта.Вставить("прочий доход", "other");
		
	КонецЕсли;
	
	Возврат Карта;
	
КонецФункции

Функция НаборКодовИконок(ЭтоРасход)
	
	Если ЭтоРасход Тогда
		
		Возврат СтрРазделить(
			"cart,fuel,home,bolt,bus,car,ticket,cup,shirt,medkit,cross,phone,wifi,book,gift,other", ",");
		
	КонецЕсли;
	
	Возврат СтрРазделить("wallet,gift,percent,refund,briefcase,chart,coin,other", ",");
	
КонецФункции

Функция ПредставлениеКоличестваОпераций(Количество)
	
	Остаток10 = Количество % 10;
	Остаток100 = Количество % 100;
	
	Если Остаток10 = 1 И Остаток100 <> 11 Тогда
		
		Возврат Формат(Количество, "ЧН=0; ЧГ=") + " операция";
		
	ИначеЕсли Остаток10 >= 2 И Остаток10 <= 4 И (Остаток100 < 12 Или Остаток100 > 14) Тогда
		
		Возврат Формат(Количество, "ЧН=0; ЧГ=") + " операции";
		
	КонецЕсли;
	
	Возврат Формат(Количество, "ЧН=0; ЧГ=") + " операций";
	
КонецФункции

Функция ПредставлениеИспользования(Количество, Сумма, ПериодПодпись)
	
	СуммаТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(Сумма, Ложь);
	СуммаТекст = СтрЗаменить(СуммаТекст, Символы.НПП, " ");
	ПериодТекст = СокрЛП(Строка(ПериодПодпись));
	
	Если ПустаяСтрока(ПериодТекст) Тогда
		
		ПериодТекст = Формат(ТекущаяДата(), "ДФ='MMMM yyyy'");
		
	КонецЕсли;
	
	Текст = ПредставлениеКоличестваОпераций(Количество) + " - " + СуммаТекст + " за " + НРег(ПериодТекст);
	
	Возврат ЭкранироватьHTML(Текст);
	
КонецФункции

Процедура ДобавитьШапкуHTML(Строки, Стили)
	
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"">");
	Строки.Добавить("<style>" + Стили + "</style></head><body>");
	
КонецПроцедуры

Функция СтилиСпискаИВыбора(Акцент)
	
	Возврат БазовыеСтили()
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:12px}"
		+ ".title{font-size:18px;font-weight:700}"
		+ ".icon-btn{width:40px;height:40px;border-radius:12px;background:#FFFFFF;border:1px solid #E5E7EB;"
		+ "display:flex;align-items:center;justify-content:center}"
		+ ".icon-btn.ghost{visibility:hidden}"
		+ ".search{display:flex;align-items:center;gap:10px;background:#FFFFFF;border:1px solid #E5E7EB;"
		+ "border-radius:14px;padding:12px 14px;margin-bottom:10px}"
		+ ".search-text{color:#6B7280;font-size:14px}"
		+ ".info,.hint{background:#FFFFFF;border:1px solid #E5E7EB;border-radius:14px;padding:12px 14px;"
		+ "color:#6B7280;font-size:13px;margin-bottom:12px}"
		+ ".list{display:flex;flex-direction:column;gap:8px;padding-bottom:24px}"
		+ ".list.choice{padding-bottom:88px}"
		+ ".item{display:flex;align-items:center;gap:12px;background:#FFFFFF;border:1px solid #E5E7EB;"
		+ "border-radius:16px;padding:12px}"
		+ ".item.group{background:#F8FAFC}"
		+ ".item.selected{border-color:#2563EB;background:#EFF6FF}"
		+ ".section-title{font-size:14px;font-weight:600;margin:4px 0 12px;color:#6B7280}"
		+ ".ico{width:44px;height:44px;border-radius:22px;display:flex;align-items:center;justify-content:center;flex:0 0 auto}"
		+ ".ico svg{width:22px;height:22px}"
		+ ".mid{flex:1;min-width:0;display:flex;flex-direction:column;gap:2px}"
		+ ".name{font-size:15px;font-weight:600}"
		+ ".sub{font-size:12px;color:#6B7280;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
		+ ".right{display:flex;align-items:center;gap:6px;color:#6B7280;font-size:12px}"
		+ ".check{color:#2563EB;font-size:18px;font-weight:700}"
		+ ".chev{font-size:20px;color:#9CA3AF}"
		+ ".empty{text-align:center;color:#6B7280;padding:40px 12px}";
	
КонецФункции

Функция СтилиКнопкиВыбора(Акцент)
	
	Возврат ".footer{position:fixed;left:0;right:0;bottom:0;padding:12px 16px 20px;background:linear-gradient(180deg,rgba(250,250,250,0),#FAFAFA 28%)}"
		+ ".btn{display:block;text-align:center;background:" + Акцент.Кнопка + ";color:#FFFFFF;font-weight:700;"
		+ "font-size:15px;border-radius:14px;padding:14px 16px}";
	
КонецФункции

Функция СтилиЭлемента(Акцент)
	
	Возврат БазовыеСтили()
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:14px}"
		+ ".title{font-size:18px;font-weight:700}"
		+ ".icon-btn{width:40px;height:40px;border-radius:12px;background:#FFFFFF;border:1px solid #E5E7EB;"
		+ "display:flex;align-items:center;justify-content:center}"
		+ ".icon-btn.ghost{visibility:hidden}"
		+ ".hero,.card{display:flex;align-items:center;gap:12px;background:#FFFFFF;border:1px solid #E5E7EB;"
		+ "border-radius:16px;padding:14px;margin-bottom:10px}"
		+ ".hero{justify-content:space-between}"
		+ ".hero-text{flex:1;font-weight:600}"
		+ ".card{flex-direction:column;align-items:stretch;gap:4px}"
		+ ".card.row{flex-direction:row;align-items:center;justify-content:space-between}"
		+ ".label{font-size:12px;color:#6B7280}"
		+ ".value{font-size:15px;font-weight:600}"
		+ ".value.muted{font-weight:500;color:#6B7280}"
		+ ".ico{width:44px;height:44px;border-radius:22px;display:flex;align-items:center;justify-content:center}"
		+ ".ico.big{width:56px;height:56px;border-radius:28px}"
		+ ".ico svg{width:22px;height:22px}"
		+ ".ico.big svg{width:26px;height:26px}"
		+ ".switch{width:44px;height:26px;border-radius:13px;background:#E5E7EB;position:relative}"
		+ ".switch:after{content:"""";position:absolute;top:3px;left:3px;width:20px;height:20px;"
		+ "border-radius:10px;background:#FFFFFF}"
		+ ".switch.on{background:" + Акцент.Кнопка + "}"
		+ ".switch.on:after{left:21px}"
		+ ".info{background:#FFFFFF;border:1px solid #E5E7EB;border-radius:14px;padding:12px 14px;"
		+ "color:#6B7280;font-size:13px;margin:8px 0 88px}"
		+ ".footer{position:fixed;left:0;right:0;bottom:0;padding:12px 16px 20px;background:linear-gradient(180deg,rgba(250,250,250,0),#FAFAFA 28%)}"
		+ ".btn{display:block;text-align:center;background:" + Акцент.Кнопка + ";color:#FFFFFF;font-weight:700;"
		+ "font-size:15px;border-radius:14px;padding:14px 16px}"
		+ ".btn.disabled{background:#E5E7EB;color:#6B7280}"
		+ ".chev{font-size:20px;color:#9CA3AF}";
	
КонецФункции

Функция СтилиСеткиИконок(Акцент)
	
	Возврат ".section-title{font-size:14px;font-weight:600;margin:4px 0 12px;color:#6B7280}"
		+ ".icons{display:grid;grid-template-columns:repeat(4,1fr);gap:10px}"
		+ ".icon-cell{background:#FFFFFF;border:1px solid #E5E7EB;border-radius:16px;padding:14px;"
		+ "display:flex;align-items:center;justify-content:center}"
		+ ".icon-cell.selected{border-color:#2563EB;box-shadow:inset 0 0 0 1px #2563EB}"
		+ ".icon-cell .ico{width:48px;height:48px;border-radius:24px}";
	
КонецФункции

Функция БазовыеСтили()
	
	Возврат "*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}"
		+ "body{font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,Arial,sans-serif;"
		+ "background:#FAFAFA;color:#111827;padding:12px 16px 24px;line-height:1.35}"
		+ "a{text-decoration:none;color:inherit;display:block}";
	
КонецФункции

Функция SVGСтрелкаНазад()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""#111827"" stroke-width=""2"">"
		+ "<path d=""M15 18l-6-6 6-6""/></svg>";
	
КонецФункции

Функция SVGПлюс(Акцент)
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""" + Акцент.Цвет + """ stroke-width=""2"">"
		+ "<path d=""M12 5v14M5 12h14""/></svg>";
	
КонецФункции

Функция SVGПоиск()
	
	Возврат "<svg viewBox=""0 0 24 24"" width=""18"" height=""18"" fill=""none"" stroke=""#9CA3AF"" stroke-width=""2"">"
		+ "<circle cx=""11"" cy=""11"" r=""7""/><path d=""M20 20l-3-3""/></svg>";
	
КонецФункции

Функция SVGПапка()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
		+ "<path d=""M3 7a2 2 0 012-2h5l2 2h7a2 2 0 012 2v8a2 2 0 01-2 2H5a2 2 0 01-2-2V7z""/></svg>";
	
КонецФункции

Функция SVGКорзина()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""#9CA3AF"" stroke-width=""2"">"
		+ "<path d=""M3 6h18M8 6V4h8v2M6 6l1 14h10l1-14""/></svg>";
	
КонецФункции

Функция SVGИконкаКатегории(КодИконки)
	
	Если КодИконки = "cart" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<circle cx=""9"" cy=""20"" r=""1""/><circle cx=""17"" cy=""20"" r=""1""/>"
			+ "<path d=""M3 3h2l2 12h10l2-8H7""/></svg>";
		
	ИначеЕсли КодИконки = "fuel" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M4 20V6a2 2 0 012-2h6a2 2 0 012 2v14M4 20h10M14 10h2a2 2 0 012 2v5a2 2 0 002 2""/></svg>";
		
	ИначеЕсли КодИконки = "home" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M3 10l9-7 9 7v9a2 2 0 01-2 2H5a2 2 0 01-2-2v-9z""/></svg>";
		
	ИначеЕсли КодИконки = "bolt" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M13 2L3 14h8l-1 8 10-12h-8l1-8z""/></svg>";
		
	ИначеЕсли КодИконки = "bus" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<rect x=""4"" y=""3"" width=""16"" height=""14"" rx=""2""/><path d=""M4 17h16M8 21v-4M16 21v-4""/></svg>";
		
	ИначеЕсли КодИконки = "car" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M3 13l2-5h14l2 5M5 17h14M7 17v2M17 17v2""/></svg>";
		
	ИначеЕсли КодИконки = "ticket" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M3 9a2 2 0 010-4h18a2 2 0 010 4M3 15a2 2 0 000 4h18a2 2 0 000-4M9 5v14""/></svg>";
		
	ИначеЕсли КодИконки = "cup" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M5 7h11v7a4 4 0 01-4 4H9a4 4 0 01-4-4V7zM16 9h2a3 3 0 010 6h-2""/></svg>";
		
	ИначеЕсли КодИконки = "shirt" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M8 4l4 3 4-3 4 3v4l-3-1v10H7V10L4 11V7l4-3z""/></svg>";
		
	ИначеЕсли КодИконки = "medkit" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<rect x=""3"" y=""7"" width=""18"" height=""13"" rx=""2""/><path d=""M9 7V5h6v2M12 11v5M9.5 13.5h5""/></svg>";
		
	ИначеЕсли КодИконки = "cross" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M10 3h4v7h7v4h-7v7h-4v-7H3v-4h7V3z""/></svg>";
		
	ИначеЕсли КодИконки = "phone" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<rect x=""7"" y=""2"" width=""10"" height=""20"" rx=""2""/><path d=""M11 18h2""/></svg>";
		
	ИначеЕсли КодИконки = "wifi" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M5 12a9 9 0 0114 0M8.5 15.5a5 5 0 017 0M12 19h.01""/></svg>";
		
	ИначеЕсли КодИконки = "book" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M4 5a2 2 0 012-2h12v16H6a2 2 0 00-2 2V5z""/></svg>";
		
	ИначеЕсли КодИконки = "gift" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<rect x=""3"" y=""10"" width=""18"" height=""11"" rx=""1""/><path d=""M12 10v11M3 14h18M12 10C9 6 6 7 6 9s2 2 6 1c4 1 6 0 6-1s-3-3-6-1z""/></svg>";
		
	ИначеЕсли КодИконки = "wallet" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<rect x=""2"" y=""6"" width=""20"" height=""14"" rx=""2""/><path d=""M16 12h4""/></svg>";
		
	ИначеЕсли КодИконки = "percent" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<circle cx=""7"" cy=""7"" r=""2""/><circle cx=""17"" cy=""17"" r=""2""/><path d=""M6 18L18 6""/></svg>";
		
	ИначеЕсли КодИконки = "refund" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M9 14l-4-4 4-4M5 10h11a4 4 0 010 8h-3""/></svg>";
		
	ИначеЕсли КодИконки = "briefcase" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<rect x=""3"" y=""7"" width=""18"" height=""13"" rx=""2""/><path d=""M9 7V5h6v2""/></svg>";
		
	ИначеЕсли КодИконки = "chart" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<path d=""M4 19V5M4 19h16M8 17V11M12 17V8M16 17v-5""/></svg>";
		
	ИначеЕсли КодИконки = "coin" Тогда
		
		Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
			+ "<circle cx=""12"" cy=""12"" r=""8""/><path d=""M12 7v10M9 9.5c1-.8 5-.8 5 1.5s-4 1.7-5 2.5 5 1.5 5 1.5""/></svg>";
		
	КонецЕсли;
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"">"
		+ "<path d=""M12 5v14M5 12h14""/></svg>";
	
КонецФункции

#КонецОбласти
